Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF8390.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA4" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF64">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA4" edc:desc="" edc:mask="0xff" edc:name="LCDDATA4" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S32C0" edc:desc="" edc:mask="0x1" edc:name="S32C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S33C0" edc:desc="" edc:mask="0x1" edc:name="S33C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S34C0" edc:desc="" edc:mask="0x1" edc:name="S34C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S35C0" edc:desc="" edc:mask="0x1" edc:name="S35C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S36C0" edc:desc="" edc:mask="0x1" edc:name="S36C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S37C0" edc:desc="" edc:mask="0x1" edc:name="S37C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S38C0" edc:desc="" edc:mask="0x1" edc:name="S38C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S39C0" edc:desc="" edc:mask="0x1" edc:name="S39C0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG32COM0" edc:desc="" edc:mask="0x1" edc:name="SEG32COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG33COM0" edc:desc="" edc:mask="0x1" edc:name="SEG33COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG34COM0" edc:desc="" edc:mask="0x1" edc:name="SEG34COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG35COM0" edc:desc="" edc:mask="0x1" edc:name="SEG35COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG36COM0" edc:desc="" edc:mask="0x1" edc:name="SEG36COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG37COM0" edc:desc="" edc:mask="0x1" edc:name="SEG37COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG38COM0" edc:desc="" edc:mask="0x1" edc:name="SEG38COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG39COM0" edc:desc="" edc:mask="0x1" edc:name="SEG39COM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA5" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF65">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA5" edc:desc="" edc:mask="0xff" edc:name="LCDDATA5" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S40C0" edc:desc="" edc:mask="0x1" edc:name="S40C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S41C0" edc:desc="" edc:mask="0x1" edc:name="S41C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S42C0" edc:desc="" edc:mask="0x1" edc:name="S42C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S43C0" edc:desc="" edc:mask="0x1" edc:name="S43C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S44C0" edc:desc="" edc:mask="0x1" edc:name="S44C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S45C0" edc:desc="" edc:mask="0x1" edc:name="S45C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S46C0" edc:desc="" edc:mask="0x1" edc:name="S46C0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S47C0" edc:desc="" edc:mask="0x1" edc:name="S47C0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG40COM0" edc:desc="" edc:mask="0x1" edc:name="SEG40COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG41COM0" edc:desc="" edc:mask="0x1" edc:name="SEG41COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG42COM0" edc:desc="" edc:mask="0x1" edc:name="SEG42COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG43COM0" edc:desc="" edc:mask="0x1" edc:name="SEG43COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG44COM0" edc:desc="" edc:mask="0x1" edc:name="SEG44COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG45COM0" edc:desc="" edc:mask="0x1" edc:name="SEG45COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG46COM0" edc:desc="" edc:mask="0x1" edc:name="SEG46COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG47COM0" edc:desc="" edc:mask="0x1" edc:name="SEG47COM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="S40C15" edc:desc="" edc:mask="0x1" edc:name="S40C15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA6" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF66">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA6" edc:desc="" edc:mask="0xff" edc:name="LCDDATA6" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S0C1" edc:desc="" edc:mask="0x1" edc:name="S0C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S1C1" edc:desc="" edc:mask="0x1" edc:name="S1C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S2C1" edc:desc="" edc:mask="0x1" edc:name="S2C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S3C1" edc:desc="" edc:mask="0x1" edc:name="S3C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S4C1" edc:desc="" edc:mask="0x1" edc:name="S4C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S5C1" edc:desc="" edc:mask="0x1" edc:name="S5C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S6C1" edc:desc="" edc:mask="0x1" edc:name="S6C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S7C1" edc:desc="" edc:mask="0x1" edc:name="S7C1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG0COM1" edc:desc="" edc:mask="0x1" edc:name="SEG0COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG1COM1" edc:desc="" edc:mask="0x1" edc:name="SEG1COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG2COM1" edc:desc="" edc:mask="0x1" edc:name="SEG2COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG3COM1" edc:desc="" edc:mask="0x1" edc:name="SEG3COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG4COM1" edc:desc="" edc:mask="0x1" edc:name="SEG4COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG5COM1" edc:desc="" edc:mask="0x1" edc:name="SEG5COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG6COM1" edc:desc="" edc:mask="0x1" edc:name="SEG6COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG7COM1" edc:desc="" edc:mask="0x1" edc:name="SEG7COM1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="S00C1" edc:desc="" edc:mask="0x1" edc:name="S00C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S01C1" edc:desc="" edc:mask="0x1" edc:name="S01C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S02C1" edc:desc="" edc:mask="0x1" edc:name="S02C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S03C1" edc:desc="" edc:mask="0x1" edc:name="S03C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S04C1" edc:desc="" edc:mask="0x1" edc:name="S04C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S05C1" edc:desc="" edc:mask="0x1" edc:name="S05C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S06C1" edc:desc="" edc:mask="0x1" edc:name="S06C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S07C1" edc:desc="" edc:mask="0x1" edc:name="S07C1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA7" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF67">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA7" edc:desc="" edc:mask="0xff" edc:name="LCDDATA7" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S8C1" edc:desc="" edc:mask="0x1" edc:name="S8C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S9C1" edc:desc="" edc:mask="0x1" edc:name="S9C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S10C1" edc:desc="" edc:mask="0x1" edc:name="S10C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S11C1" edc:desc="" edc:mask="0x1" edc:name="S11C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S12C1" edc:desc="" edc:mask="0x1" edc:name="S12C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S13C1" edc:desc="" edc:mask="0x1" edc:name="S13C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S14C1" edc:desc="" edc:mask="0x1" edc:name="S14C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S15C1" edc:desc="" edc:mask="0x1" edc:name="S15C1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG8COM1" edc:desc="" edc:mask="0x1" edc:name="SEG8COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG9COM1" edc:desc="" edc:mask="0x1" edc:name="SEG9COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG10COM1" edc:desc="" edc:mask="0x1" edc:name="SEG10COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG11COM1" edc:desc="" edc:mask="0x1" edc:name="SEG11COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG12COM1" edc:desc="" edc:mask="0x1" edc:name="SEG12COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG13COM1" edc:desc="" edc:mask="0x1" edc:name="SEG13COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG14COM1" edc:desc="" edc:mask="0x1" edc:name="SEG14COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG15COM1" edc:desc="" edc:mask="0x1" edc:name="SEG15COM1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="S08C1" edc:desc="" edc:mask="0x1" edc:name="S08C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S09C1" edc:desc="" edc:mask="0x1" edc:name="S09C1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA8" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA8" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF68">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA8" edc:desc="" edc:mask="0xff" edc:name="LCDDATA8" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S16C1" edc:desc="" edc:mask="0x1" edc:name="S16C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S17C1" edc:desc="" edc:mask="0x1" edc:name="S17C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S18C1" edc:desc="" edc:mask="0x1" edc:name="S18C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S19C1" edc:desc="" edc:mask="0x1" edc:name="S19C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S20C1" edc:desc="" edc:mask="0x1" edc:name="S20C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S21C1" edc:desc="" edc:mask="0x1" edc:name="S21C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S22C1" edc:desc="" edc:mask="0x1" edc:name="S22C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S23C1" edc:desc="" edc:mask="0x1" edc:name="S23C1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG16COM1" edc:desc="" edc:mask="0x1" edc:name="SEG16COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG17COM1" edc:desc="" edc:mask="0x1" edc:name="SEG17COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG18COM1" edc:desc="" edc:mask="0x1" edc:name="SEG18COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG19COM1" edc:desc="" edc:mask="0x1" edc:name="SEG19COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG20COM1" edc:desc="" edc:mask="0x1" edc:name="SEG20COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG21COM1" edc:desc="" edc:mask="0x1" edc:name="SEG21COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG22COM1" edc:desc="" edc:mask="0x1" edc:name="SEG22COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG23COM1" edc:desc="" edc:mask="0x1" edc:name="SEG23COM1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA9" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA9" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF69">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA9" edc:desc="" edc:mask="0xff" edc:name="LCDDATA9" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S24C1" edc:desc="" edc:mask="0x1" edc:name="S24C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S25C1" edc:desc="" edc:mask="0x1" edc:name="S25C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S26C1" edc:desc="" edc:mask="0x1" edc:name="S26C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S27C1" edc:desc="" edc:mask="0x1" edc:name="S27C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S28C1" edc:desc="" edc:mask="0x1" edc:name="S28C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S29C1" edc:desc="" edc:mask="0x1" edc:name="S29C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S30C1" edc:desc="" edc:mask="0x1" edc:name="S30C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S31C1" edc:desc="" edc:mask="0x1" edc:name="S31C1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG24COM1" edc:desc="" edc:mask="0x1" edc:name="SEG24COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG25COM1" edc:desc="" edc:mask="0x1" edc:name="SEG25COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG26COM1" edc:desc="" edc:mask="0x1" edc:name="SEG26COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG27COM1" edc:desc="" edc:mask="0x1" edc:name="SEG27COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG28COM1" edc:desc="" edc:mask="0x1" edc:name="SEG28COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG29COM1" edc:desc="" edc:mask="0x1" edc:name="SEG29COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG30COM1" edc:desc="" edc:mask="0x1" edc:name="SEG30COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG31COM1" edc:desc="" edc:mask="0x1" edc:name="SEG31COM1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA10" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA10" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF6A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDDATA10" edc:desc="" edc:mask="0xff" edc:name="LCDDATA10" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="S32C1" edc:desc="" edc:mask="0x1" edc:name="S32C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S33C1" edc:desc="" edc:mask="0x1" edc:name="S33C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S34C1" edc:desc="" edc:mask="0x1" edc:name="S34C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S35C1" edc:desc="" edc:mask="0x1" edc:name="S35C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S36C1" edc:desc="" edc:mask="0x1" edc:name="S36C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S37C1" edc:desc="" edc:mask="0x1" edc:name="S37C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S38C1" edc:desc="" edc:mask="0x1" edc:name="S38C1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S39C1" edc:desc="" edc:mask="0x1" edc:name="S39C1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SEG32COM1" edc:desc="" edc:mask="0x1" edc:name="SEG32COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG33COM1" edc:desc="" edc:mask="0x1" edc:name="SEG33COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG34COM1" edc:desc="" edc:mask="0x1" edc:name="SEG34COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG35COM1" edc:desc="" edc:mask="0x1" edc:name="SEG35COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG36COM1" edc:desc="" edc:mask="0x1" edc:name="SEG36COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG37COM1" edc:desc="" edc:mask="0x1" edc:name="SEG37COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG38COM1" edc:desc="" edc:mask="0x1" edc:name="SEG38COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG39COM1" edc:desc="" edc:mask="0x1" edc:name="SEG39COM1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnrrr" edc:cname="RCSTA2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000x" edc:name="RCSTA2" edc:nzwidth="0x8" edc:por="0000000x" edc:_addr="0xF6B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RX9D" edc:desc="" edc:mask="0x1" edc:name="RX9D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR" edc:desc="" edc:mask="0x1" edc:name="OERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:desc="" edc:mask="0x1" edc:name="FERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="" edc:mask="0x1" edc:name="ADDEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN" edc:desc="" edc:mask="0x1" edc:name="CREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SREN" edc:desc="" edc:mask="0x1" edc:name="SREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX9" edc:desc="" edc:mask="0x1" edc:name="RX9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPEN" edc:desc="" edc:mask="0x1" edc:name="SPEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RCD8" edc:desc="" edc:mask="0x1" edc:name="RCD8" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ADEN" edc:desc="" edc:mask="0x1" edc:name="ADEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RC9" edc:desc="" edc:mask="0x1" edc:name="RC9" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="nRC8" edc:desc="" edc:mask="0x1" edc:name="nRC8" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="RC8_9" edc:desc="" edc:mask="0x1" edc:name="RC8_9" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="RX9D2" edc:desc="" edc:mask="0x1" edc:name="RX9D2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR2" edc:desc="" edc:mask="0x1" edc:name="OERR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR2" edc:desc="" edc:mask="0x1" edc:name="FERR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN2" edc:desc="" edc:mask="0x1" edc:name="ADDEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN2" edc:desc="" edc:mask="0x1" edc:name="CREN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SREN2" edc:desc="" edc:mask="0x1" edc:name="SREN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX92" edc:desc="" edc:mask="0x1" edc:name="RX92" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPEN2" edc:desc="" edc:mask="0x1" edc:name="SPEN2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RCD82" edc:desc="" edc:mask="0x1" edc:name="RCD82" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="RC8_92" edc:desc="" edc:mask="0x1" edc:name="RC8_92" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="RC92" edc:desc="" edc:mask="0x1" edc:name="RC92" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
